RQs/collection-code/wrk2-logs/w1_rate=1200_2026-02-26 19_18_02_output.txt
Running 10s test @ http://127.0.0.1:9090/wrk2-api/post/compose
  16 threads and 32 connections

  Thread calibration: mean lat.: 3.089ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.132ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.096ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.107ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.113ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.169ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.113ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.103ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://127.0.0.1:9090/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.15ms    0.87ms   6.16ms   78.49%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.92ms
 75.000%    3.52ms
 90.000%    4.27ms
 99.000%    6.16ms
 99.900%    8.16ms
 99.990%    9.46ms
 99.999%    9.95ms
100.000%    9.95ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.748     0.000000            1         1.00
       2.311     0.100000          602         1.11
       2.475     0.200000         1205         1.25
       2.619     0.300000         1805         1.43
       2.763     0.400000         2402         1.67
       2.917     0.500000         3003         2.00
       3.005     0.550000         3304         2.22
       3.109     0.600000         3609         2.50
       3.229     0.650000         3911         2.86
       3.359     0.700000         4202         3.33
       3.523     0.750000         4503         4.00
       3.621     0.775000         4656         4.44
       3.713     0.800000         4805         5.00
       3.811     0.825000         4952         5.71
       3.939     0.850000         5104         6.67
       4.085     0.875000         5253         8.00
       4.175     0.887500         5328         8.89
       4.267     0.900000         5402        10.00
       4.355     0.912500         5479        11.43
       4.495     0.925000         5552        13.33
       4.623     0.937500         5628        16.00
       4.719     0.943750         5665        17.78
       4.847     0.950000         5702        20.00
       4.955     0.956250         5740        22.86
       5.099     0.962500         5779        26.67
       5.219     0.968750         5815        32.00
       5.303     0.971875         5834        35.56
       5.355     0.975000         5852        40.00
       5.519     0.978125         5871        45.71
       5.651     0.981250         5890        53.33
       5.819     0.984375         5909        64.00
       5.919     0.985938         5918        71.11
       5.991     0.987500         5927        80.00
       6.083     0.989062         5937        91.43
       6.207     0.990625         5946       106.67
       6.367     0.992188         5956       128.00
       6.451     0.992969         5960       142.22
       6.611     0.993750         5965       160.00
       6.751     0.994531         5970       182.86
       6.823     0.995313         5974       213.33
       7.215     0.996094         5979       256.00
       7.247     0.996484         5981       284.44
       7.347     0.996875         5984       320.00
       7.559     0.997266         5986       365.71
       7.687     0.997656         5988       426.67
       7.939     0.998047         5991       512.00
       7.983     0.998242         5992       568.89
       8.003     0.998437         5993       640.00
       8.015     0.998633         5994       731.43
       8.119     0.998828         5995       853.33
       8.735     0.999023         5997      1024.00
       8.735     0.999121         5997      1137.78
       8.935     0.999219         5998      1280.00
       8.935     0.999316         5998      1462.86
       8.959     0.999414         5999      1706.67
       9.031     0.999512         6000      2048.00
       9.031     0.999561         6000      2275.56
       9.031     0.999609         6000      2560.00
       9.031     0.999658         6000      2925.71
       9.463     0.999707         6001      3413.33
       9.463     0.999756         6001      4096.00
       9.463     0.999780         6001      4551.11
       9.463     0.999805         6001      5120.00
       9.463     0.999829         6001      5851.43
       9.951     0.999854         6002      6826.67
       9.951     1.000000         6002          inf
#[Mean    =        3.149, StdDeviation   =        0.871]
#[Max     =        9.944, Total count    =         6002]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  11912 requests in 10.00s, 2.44MB read
Requests/sec:   1190.88  
Transfer/sec:    250.04KB