RQs/collection-code/wrk2-logs/w1_rate=1600_2026-02-26 19_18_12_output.txt
Running 10s test @ http://127.0.0.1:9090/wrk2-api/post/compose
  16 threads and 32 connections

  Thread calibration: mean lat.: 3.054ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.088ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.031ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.052ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.153ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.121ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.064ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.055ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.027ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.045ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.072ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.065ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.023ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.055ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://127.0.0.1:9090/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.09ms    0.90ms   6.59ms   83.02%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.84ms
 75.000%    3.37ms
 90.000%    4.16ms
 99.000%    6.59ms
 99.900%    8.97ms
 99.990%   10.60ms
 99.999%   10.60ms
100.000%   10.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.846     0.000000            1         1.00
       2.315     0.100000          203         1.11
       2.469     0.200000          401         1.25
       2.585     0.300000          599         1.43
       2.711     0.400000          800         1.67
       2.839     0.500000          997         2.00
       2.913     0.550000         1096         2.22
       3.003     0.600000         1195         2.50
       3.113     0.650000         1295         2.86
       3.223     0.700000         1394         3.33
       3.367     0.750000         1495         4.00
       3.445     0.775000         1544         4.44
       3.537     0.800000         1593         5.00
       3.645     0.825000         1644         5.71
       3.799     0.850000         1693         6.67
       4.007     0.875000         1744         8.00
       4.081     0.887500         1768         8.89
       4.163     0.900000         1792        10.00
       4.303     0.912500         1817        11.43
       4.495     0.925000         1842        13.33
       4.711     0.937500         1867        16.00
       4.787     0.943750         1880        17.78
       4.871     0.950000         1892        20.00
       5.003     0.956250         1904        22.86
       5.119     0.962500         1917        26.67
       5.287     0.968750         1929        32.00
       5.371     0.971875         1936        35.56
       5.519     0.975000         1942        40.00
       5.751     0.978125         1948        45.71
       5.915     0.981250         1954        53.33
       6.171     0.984375         1960        64.00
       6.375     0.985938         1964        71.11
       6.515     0.987500         1967        80.00
       6.579     0.989062         1970        91.43
       6.731     0.990625         1974       106.67
       6.819     0.992188         1976       128.00
       6.863     0.992969         1978       142.22
       6.915     0.993750         1979       160.00
       7.163     0.994531         1981       182.86
       7.223     0.995313         1982       213.33
       7.471     0.996094         1984       256.00
       7.627     0.996484         1985       284.44
       7.627     0.996875         1985       320.00
       7.827     0.997266         1986       365.71
       7.855     0.997656         1987       426.67
       7.879     0.998047         1988       512.00
       7.879     0.998242         1988       568.89
       7.879     0.998437         1988       640.00
       8.967     0.998633         1989       731.43
       8.967     0.998828         1989       853.33
       9.103     0.999023         1990      1024.00
       9.103     0.999121         1990      1137.78
       9.103     0.999219         1990      1280.00
       9.103     0.999316         1990      1462.86
       9.103     0.999414         1990      1706.67
      10.599     0.999512         1991      2048.00
      10.599     1.000000         1991          inf
#[Mean    =        3.095, StdDeviation   =        0.903]
#[Max     =       10.592, Total count    =         1991]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  15912 requests in 10.00s, 3.26MB read
Requests/sec:   1590.67  
Transfer/sec:    333.98KB