RQs/collection-code/wrk2-logs/w1_rate=2000_2026-02-26 19_18_22_output.txt
Running 10s test @ http://127.0.0.1:9090/wrk2-api/post/compose
  16 threads and 32 connections

  Thread calibration: mean lat.: 3.149ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.112ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.178ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.192ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.112ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.192ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.156ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.145ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.093ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://127.0.0.1:9090/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.15ms    1.04ms   6.82ms   86.85%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.85ms
 75.000%    3.35ms
 90.000%    4.40ms
 99.000%    6.82ms
 99.900%   11.74ms
 99.990%   15.93ms
 99.999%   16.99ms
100.000%   16.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.786     0.000000            1         1.00
       2.335     0.100000          863         1.11
       2.477     0.200000         1720         1.25
       2.597     0.300000         2578         1.43
       2.717     0.400000         3424         1.67
       2.847     0.500000         4279         2.00
       2.919     0.550000         4705         2.22
       3.001     0.600000         5130         2.50
       3.093     0.650000         5560         2.86
       3.209     0.700000         5997         3.33
       3.347     0.750000         6414         4.00
       3.445     0.775000         6626         4.44
       3.559     0.800000         6840         5.00
       3.697     0.825000         7055         5.71
       3.877     0.850000         7272         6.67
       4.103     0.875000         7484         8.00
       4.255     0.887500         7588         8.89
       4.407     0.900000         7696        10.00
       4.579     0.912500         7803        11.43
       4.759     0.925000         7909        13.33
       4.967     0.937500         8017        16.00
       5.055     0.943750         8069        17.78
       5.187     0.950000         8123        20.00
       5.315     0.956250         8175        22.86
       5.467     0.962500         8229        26.67
       5.631     0.968750         8282        32.00
       5.787     0.971875         8310        35.56
       5.923     0.975000         8336        40.00
       6.075     0.978125         8362        45.71
       6.223     0.981250         8389        53.33
       6.443     0.984375         8416        64.00
       6.567     0.985938         8429        71.11
       6.639     0.987500         8443        80.00
       6.727     0.989062         8456        91.43
       6.931     0.990625         8469       106.67
       7.195     0.992188         8484       128.00
       7.279     0.992969         8489       142.22
       7.375     0.993750         8496       160.00
       7.583     0.994531         8503       182.86
       8.031     0.995313         8510       213.33
       8.131     0.996094         8516       256.00
       8.439     0.996484         8519       284.44
       8.615     0.996875         8523       320.00
       8.719     0.997266         8526       365.71
       9.071     0.997656         8529       426.67
       9.687     0.998047         8533       512.00
      10.519     0.998242         8534       568.89
      11.151     0.998437         8536       640.00
      11.463     0.998633         8538       731.43
      11.479     0.998828         8539       853.33
      11.799     0.999023         8541      1024.00
      12.255     0.999121         8542      1137.78
      12.991     0.999219         8543      1280.00
      13.031     0.999316         8544      1462.86
      13.031     0.999414         8544      1706.67
      13.527     0.999512         8545      2048.00
      14.039     0.999561         8546      2275.56
      14.039     0.999609         8546      2560.00
      15.751     0.999658         8547      2925.71
      15.751     0.999707         8547      3413.33
      15.751     0.999756         8547      4096.00
      15.927     0.999780         8548      4551.11
      15.927     0.999805         8548      5120.00
      15.927     0.999829         8548      5851.43
      15.927     0.999854         8548      6826.67
      15.927     0.999878         8548      8192.00
      16.991     0.999890         8549      9102.22
      16.991     1.000000         8549          inf
#[Mean    =        3.147, StdDeviation   =        1.036]
#[Max     =       16.976, Total count    =         8549]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  19793 requests in 10.00s, 4.06MB read
Requests/sec:   1978.80  
Transfer/sec:    415.47KB